#include <stdio.h>

/*
    최대공약수(Greatest Common Divisor, GCD). 컴퓨터 등장 전 부터 최초로 등장한 알고리즘.

    25 - 10 = 15
    15 - 10 = 5
    10 - 5  = 5
    5 - 5   = 0 -> 최대공약수: 5
    컴퓨터 등장 후에는 빼기를 나머지 연산자로 바꾸어 한번에 산출

    유킬리드 알고리즘:
    (1) 두 수 가운데 큰 수를 x, 작은 수를 y라 한다.
    (2) y가 0이면 공약수는 x와 같다. (r은 항상 y보다 작다)
    (3) r <- x % y
    (4) x <- y
    (5) y <- r
    (6) 단계 2로 되돌아간다.
*/

int main() {
    int x, y, r;

    printf("두 정수 '큰수 작은수' 순으로 입력하세요: ");
    scanf("%d %d", &x, &y);

    while (y != 0) {
        r = x % y;
        x = y;
        y = r;
    }

    printf("최대공약수는 %d입니다.", x);

    return 0;
}
